using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Coursework
{
    public partial class Teor1 : Form
    {
        public Teor1()
        {
            InitializeComponent();
            north.Visible = true;
            south.Visible = false;
            greenland.Visible = false;
        }

        public Teor1(int number)
        {
            InitializeComponent();
            if (number == 2)
            {

                south.Visible = true;
                richTextBox1.Text =
                    "Півде́нна Аме́рика (ісп. América del Sur, Sudamérica, Suramérica, порт. América do Sul, англ. South America, нід. Zuid-Amerika, фр. Amérique du Sud, гуар. Ñembyamérika, кеч. Urin Awya Yala, Urin Amerika) — материк, розташований в Західній, Південній і частково в Північній півкулях планети Земля. На заході омивається водами Тихого океану, на сході — Атлантичного. На півночі з'єднаний Панамським перешийком з Північною Америкою. До складу Південної Америки входить також низка островів. Великі й Малі Антильські острови Карибського моря належать до Північної Америки.\nПлоща континенту — 17,8 млн км²[2] (4-е місце серед континентів), населення — 385 742 554 осіб (2008, 5-е місце серед континентів).\n\nПротяжність з півночі на південь — 7350 км(приблизно).Протяжність із заходу на схід — 4900 км(приблизно).\n\n Всього в Південній Америці розташовано 12 незалежних країн: Аргентина, Болівія, Бразилія, Венесуела, Гаяна, Колумбія, Парагвай, Перу, Суринам, Уругвай,  Чилі, Еквадор. Найбільша південноамериканська країна — Бразилія, її площа 8 515 770 квадратних кілометрів. Плюс залежні території інших країн: Фолклендські Острови, Французька Гвіана, Південна Джорджія та Південні Сандвічеві острови.\n\nБлизько половини населення Південної Америки, живе в Бразилії. Розмовляють тут на місцевому діалекті португальської мови.\n\nНайзнаменитіші водоспади світу також розташовані в Південній Америці. Анхель — найвищий з них, а Ігуасу — найпотужніший.\n\nНайбільша річка в світі протікає по цьому континенту. Амазонка має понад півтисячі приток.";
            }
                
            if (number == 3)
            {
                north.Visible = false;
                south.Visible = false;
                greenland.Visible = true;
                richTextBox1.Text = "Гренлáндія, Ґренлáндія або Калааліт (гренл. Kalaallit Nunaat, МФА: [kaˈlaːɬit ˈnunaːt]; дан. Grønland, дослівно — «зелена країна») — автономна установча країна в складі Королівства Данія і найбільший острів планети, що розташований між Північно-Льодовитим та Атлантичним океаном, на схід від Канадського Арктичного архіпелагу. Близько 80 % площі Гренландії вкрито другим на планеті за розміром і єдиним поза межами Антарктиди постійним льодовиковим щитом. Саме тут розташований Якобсхавн, найшвидший у світі льодовик — він рухається зі швидкістю приблизно тридцять метрів на день. Географічно є частиною Північної Америки, проте понад тисячоліття Гренландія підтримує тісні політичні, культурні та економічні зв'язки з Європою (особливо з Норвегією та Данією, які в минулому були колоніальними державами, а також із сусідньою Ісландією). Гренландія — найменш густонаселена країна світу з кількістю мешканців у 55992 особи (2019). Під час референдуму 2008 року на підтримку розширення автономії висловилися 75 % мешканців, що взяли участь у голосуванні. Згідно з результатами референдуму, Гренландія набула більшої незалежності у внутрішній політиці, залишивши Данії сферу зовнішньої політики та оборони.\r\n\r\nЗаселення Гренландії розпочалось чотири з половиною тисячі років тому арктичними народами, що мігрували сюди з території сучасної Канади. З 10 століття нормани почали заселяти безлюдну південну частину острова, а Інуїти прийшли сюди в 13 столітті. Норманські колонії зникли наприкінці 15 століття. На початку 18 століття контакти між скандинавами та Гренландією відновилися, і Данія встановила свій суверенітет над островом. Основне населення Гренландії — ескімоси, або, як вони самі себе називають, калаалліти. У гренландській столиці, Нуук, проживає лише близько 17 тисяч осіб. Найнижча температура, коли-небудь зафіксована в цих краях — мінус 70 градусів.";
            }
        }
        private void GoToMain()
        {
            this.Close();
            mainForm main = new mainForm();
            main.Show();
        }
       

        private void exitButton_Click(object sender, EventArgs e)
        {
            
            GoToMain();
        }
    }
}
